import React from 'react';
import './Blogs.css'
const Blogs = () => {
    return (
        <div className='blog-text'>
            <h2>What is Context Api?</h2>
            <p>Context Api রিয়েক্টর ভার্শন ষোলোতে নতুন করে যুক্ত হয়েছে। কন্টেক্সট এপিআই অনেকটা রিডাক্স এর মত কাজ করে তবে এটা রিডাক্স নয়। এটা অন্য ভাবে কাজ করে থাকে আমরা রিডাক্সে সাধারণত একটা কম্পনেন্ট থেকে অন্য কম্পনেন্ট সহজে ডাটা পাঠাতে পারি, এবং এটা propsএর মাধ্যমে পাঠাতে পারি ।  অনেক সময় আমরা দেখি মেন কম্পনেন্ট যেখানে আছে ডাটা তার সাইল কম্পনেন্ট অনেক নিচে থাকে এর মানে ডাটা কম্পোনেন্টের আরেকটা চাইল্ড কম্পনেন্ট আছে আবার সেই চাইল্ড কম্পনেন্ট আরেকটা চাইল্ড কম্পনেন্ট আছে এভাবে অনেকগুলো চাইল্ড কম্পনেন্ট হতে পারে এখন আমরা মেন কম্পনেন্ট বা যেটাকে টপ লেভেল কম্পোনেন্ট থেকে ডাটা অনেক লেভেল নিচে কোন চাইল্ড কম্পনেন্ট এ নিতে চাই তাহলে আমরা সেই সাইল কম্পোনেন্ট এর প্যারেন্ট এবং সেই প্যারেন্টস এর প্যারেন্ট এভাবে যেতে যেতে ডাটা কম্পনেন্ট অফ কম্পনেন্ট পর্যন্ত হেল্প হেলথ নিয়ে ডাটা পাস করে থাকে এটাকে ড্রিল করতে করতে একসময় ডাটার কাছে পৌঁছায় এটাকে সাধারণ রিডাক্স ব্যবহার করে করা হয় রিয়াক্ট এপিআই সেই ভাবে কাজ করে থাকে কিন্তু রিডাক্স এর মত  ঝামেলা হয় না। প্রথমে টপ লেভেল একটা কন্টেক্সট তৈরি করতে হবে টপকে মাই কন্টেক্সট দিয়ে বেঁধে দিতে হবে এবং এর থেকে ডাটা নিতে পারবে যে কোন জায়গা থেকে,এভাবেই কাজ করে।</p>
            <h2> What is Semantic Tag?</h2>
            <p> html5 এর সিমেন্টিক এলিমেন্ট সকল সাইটগুলোতে সাপোর্ট করে যখন একজন ডেভেলপার সহজেই কোন কিছু বুঝতে পারে তখন তার সাইটটা বিল্ড করা সহজ হয়ে যায় সিমেন্টিক এলিমেন্ট গুলো নাম দেখেই এলিমেন্ট কনটেন্ট গুলো সম্পর্কে ধারণা পাওয়া যায় এবং সিমেন্টিক এলিমেন্ট এ কী দেখানো হয়েছে তা দেখে বোঝা যায় একটি ওয়েবসাইট এর বিভিন্ন অংশ চিহ্নিত করতে সিমেন্টিক ব্যবহার করা হয় বডিদিয়েশুরু করলে আমরা দেখতে পারি হেডার থাকে হেডারের ভিতরে টাইটেল এবং হেডারের নিচে থাকে nav এর ভিতরে linkথাকে।তারপরে আমরা দেখতে পাই main  নামে একটা এলিমেন্ট ,main এর  ভিতর সব ধরনের এলিমেন্ট থাকে সেকশন থাকে বিভিন্ন ধরনের div থাকে article থাকে article  এর ভিতরে  প্যারাগ্রাফ থাকে আমরা দেখতে পাই  এক পাশে  Aside সাইট নামে একটা এলিমেন্ট। এবং নিচের দিকে সাধারণত একটা footer  থাকে। সবগুলো এলিমেন্ট নিজ জায়গা থেকে ডকুমেন্টের বিভিন্ন ভাবে আলাদা করে থাকে, এবং একটা ওয়েবসাইটের সুন্দর ফ্রেম তৈরি করে করে সিমেন্টিক tag।</p>
        </div>
    );
};

export default Blogs;