import React from 'react';

const Blogs = () => {
    return (
        <div>
            <h2>What is Context Api?</h2>
            <p>context api রিয়েক্টর ভার্শন ষোলোতে নতুন করে যুক্ত হয়েছে। কন্টেক্সট এপিআই অনেকটা রিডাক্স এর মত কাজ করে তবে এটা রিডাক্স নয়। এটা অন্য ভাবে কাজ করে থাকে আমরা রিডাক্সে সাধারণত একটা কম্পনেন্ট থেকে অন্য কম্পনেন্ট সহজে ডাটা পাঠাতে পারি, এবং এটা propsএর মাধ্যমে পাঠাতে পারি ।  অনেক সময় আমরা দেখি মেন কম্পনেন্ট যেখানে আছে ডাটা তার সাইল কম্পনেন্ট অনেক নিচে থাকে এর মানে ডাটা কম্পোনেন্টের আরেকটা চাইল্ড কম্পনেন্ট আছে আবার সেই চাইল্ড কম্পনেন্ট আরেকটা চাইল্ড কম্পনেন্ট আছে এভাবে অনেকগুলো চাইল্ড কম্পনেন্ট হতে পারে এখন আমরা মেন কম্পনেন্ট বা যেটাকে টপ লেভেল কম্পোনেন্ট থেকে ডাটা অনেক লেভেল নিচে কোন চাইল্ড কম্পনেন্ট এ নিতে চাই তাহলে আমরা সেই সাইল কম্পোনেন্ট এর প্যারেন্ট এবং সেই প্যারেন্টস এর প্যারেন্ট এভাবে যেতে যেতে ডাটা কম্পনেন্ট অফ কম্পনেন্ট পর্যন্ত হেল্প হেলথ নিয়ে ডাটা পাস করে থাকে এটাকে ড্রিল করতে করতে একসময় ডাটার কাছে পৌঁছায় এটাকে সাধারণ রিডাক্স ব্যবহার করে করা হয় রিয়াক্ট এপিআই সেই ভাবে কাজ করে থাকে কিন্তু রিডাক্স এর মত  ঝামেলা হয় না। প্রথমে টপ লেভেল একটা কন্টেক্সট তৈরি করতে হবে টপকে মাই কন্টেক্সট দিয়ে বেঁধে দিতে হবে এবং এর থেকে ডাটা নিতে পারবে যে কোন জায়গা থেকে,এভাবেই কাজ করে।</p>
            <h2></h2>
            <p></p>
        </div>
    );
};

export default Blogs;